<b>DS Tools & Techniques (AM 624D) ASSIGNMENT 3 </b> <br>
Submitted By : ROHIT LOHANI <br>
Reg. No. : 21-27-17 <br>
DATA SCIENCE (APPLIED MATHEMATICS)

### Importing the libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Importing the dataset

In [2]:
dataset = pd.read_csv('housingdata.csv')

##### Answer 1

In [3]:
dataset.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

##### Answer 2

In [4]:
list_of_column_name = list(dataset.columns)
print(f'The List of Column Name is : ', list_of_column_name)

list_of_rows_name = list(dataset.index)
print(f'The List of Rows Name is : ', list_of_rows_name)

The List of Column Name is :  ['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']
The List of Rows Name is :  [0, 1, 2, 3, 4, 5, 6, 7, 8]

##### Answer 3

In [5]:
# Ans 3.a

print(f'Number of “STATE” exist in the dataset is : ',dataset['STATE'].shape)

Number of “STATE” exist in the dataset is :  (9,)

In [6]:
# Ans 3.b

uniq_state = dataset['STATE'].unique()
print(uniq_state)

num_uniq_state = dataset['STATE'].nunique()
print(f'Number of Unique State is : ',num_uniq_state)

['MP' 'MAHARASHTRA' 'AP' 'TN' 'ASSAM' 'HP']
Number of Unique State is :  6

##### Answer 4

In [7]:
dataset.isnull()

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

##### Answer 5

In [8]:
dataset = pd.DataFrame(dataset)
dataset = dataset.replace(to_replace ="na", value = np.nan )
dataset.dropna(subset=['NUM_BEDROOMS'], axis = 0, inplace = True)
dataset

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

##### Answer 6

In [9]:
dataset = dataset.replace({'NUM_BATH' : '[A-Za-z]'}, np.nan, regex = True)

dataset['NUM_BATH'] = dataset['NUM_BATH'].fillna(method="ffill")
dataset

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      1.5   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2        2   950
7  100008000.0           HP      23131            1        1   NaN

##### Answer 7

In [10]:
dataset = dataset.replace(to_replace ="--", value = np.nan )

dataset['SQ_FT'] = dataset['SQ_FT'].astype(float)
dataset.SQ_FT = dataset['SQ_FT'].fillna(dataset['SQ_FT'].mean())
dataset

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1062.5
3  100004000.0           TN     321321            1      1.5   700.0
4          NaN           TN  589465645            3        2  1600.0
6  100007000.0        ASSAM    3222321            2        2   950.0
7  100008000.0           HP      23131            1        1  1062.5

##### Answer 8

In [11]:
sum1 = dataset.SQ_FT.sum()
print(f'The Sum of SQ_FT of all entries in the dataset is : ',sum1)

The Sum of SQ_FT of all entries in the dataset is :  6375.0

##### Answer 9

In [12]:
for i in range(len(dataset)):
    dataset['NUM_STORE'] = 1

dataset

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
6,100007000.0,ASSAM,3222321,2,2,950.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

##### Answer 10

In [13]:
dataset.loc[dataset['STATE'] == 'TN']

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1      1.5   700.0          1
4          NaN    TN  589465645            3        2  1600.0          1

##### Answer 11

In [14]:
dataset.loc[dataset['SQ_FT'] >= 1000 ]

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2,1600.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

##### Answer 12

In [15]:
dataset.iloc[ :3, :3].values

array([[100001000.0, 'MP', 321654],
       [100002000.0, 'MAHARASHTRA', 21325],
       [100004000.0, 'TN', 321321]], dtype=object)

##### Answer 13

In [22]:
dataset['Mean'] = dataset['PRICE'].div(dataset['SQ_FT'].values)
dataset

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE,Mean
0,100001000.0,MP,321654,3,1,1000.0,1,321.654000
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1,20.070588
3,100004000.0,TN,321321,1,1.5,700.0,1,459.030000
4,NaN,TN,589465645,3,2,1600.0,1,368416.028125
6,100007000.0,ASSAM,3222321,2,2,950.0,1,3391.916842
7,100008000.0,HP,23131,1,1,1062.5,1,21.770353

In [23]:
dataset[dataset.Mean==max(dataset.Mean)].STATE

4    TN
Name: STATE, dtype: object